app/views/choices/_form.html.erb

                                        <%= form.label :value_id, class: "control-label" %>
                                        <%= form.input_field :value_id, as: :select, collection: Value.all, class: "form-control"%>
---
SELECT "values".* FROM "values"