app/views/choices/show.html.erb

SELECT  "values".* FROM "values" WHERE "values"."id" IS NULL LIMIT 1
---
                <% @choice.each do |v| %>
                <%= v.value.name %><br />