app/views/users/show.html.erb

SELECT  "values".* FROM "values" WHERE "values"."choice_id" = ? LIMIT 1  [[nil, 28]]
---

<h1><%= choice.value.name %></h1>