app/controllers/choices_controller.rb

SELECT "values".* FROM "values"
---
  def new
    @choice = Choice.new
    @values = Value.all

INSERT INTO "choices" ("value_id", "user_id") VALUES (?, ?)  [["value_id", 87], ["user_id", 55]]
---
  def create
    choice_params = params.require(:choice).permit(:value_id  )
    @choice = Choice.new(choice_params)
    @choice.user = current_user
    if @choice.save

SELECT  "values".* FROM "values" WHERE "values"."id" = ? LIMIT 1  [["id", 87]]
---
 def find_value
   @value = Value.find_by(id: params["value_id"])