app/controllers/users_controller.rb

def show
# do something with params
@choices = Choice.where(user_id: @user)
---
SELECT "choices".* FROM "choices" WHERE "choices"."user_id" IS NULL

def create
  @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

def find_user
 @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 45]]