app/controllers/values_controller.rb

  def index
    @values = Value.all
---
SELECT "values".* FROM "values"

  def show
    @value = Value.find_by(id: params["id"])
---
SELECT  "values".* FROM "values" WHERE "values"."id" = ? LIMIT 1  [["id", 0]]